--単元末課題 DML

insert into 会社
values
(1, 'LonelyMart')
,(2, 'きいやま商店')
;


insert into 店名
values
(1, 1, '日本橋店', '東京都中央区日本橋1-1-1', '03-111-2222')
,(2, 1, '八重山店', '沖縄県浦添市安波茶1-1-1', '080-2200-3330')
;


insert into 支払方法
values
(1, 'paypay')
,(2, '現金')
,(3, 'visa')
,(4, 'Edy')
;


insert into 商品
values
(1,'いろはす天然水', 100, 0.08)
,(2,'ツナマヨおにぎり', 120, 0.08)
,(3, 'ファブリーズ', 400, 0.1)
,(4,'レジ袋', 3, 0)
;

insert into 購入品
values
(1,1,1,1)
,(2,2,1,1)
,(3,3,1,1)
,(4,4,1,1)
;

insert into レシート
values
(1, 1, '2022-04-01',1, 1, 1)
,(2, 2, '2018-09-08', 2, 3, 1)
;